source/_static/diagrams/playground.d2
direction: right
n0: "try"
n1: "widget"
n2: "reset"
n0 -> n1
n1 -> n2
